Student Enrollment, 2001-2021
students enrollmed for credit

In [9]:
import pandas as pd
import datetime as dt
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

Fall enrollment reports
File name: ef

Step 1: 
1. Upload files

In [120]:
fte_2001 = pd.read_csv("2001_ef_enrollment.csv",low_memory=False)
fte_2001.columns = fte_2001.columns.str.lower()
fte_2001 = fte_2001[['unitid','year','total fte']]
fte_2001 = fte_2001.rename(columns={'total fte':'student fte'})
fte_2001.head(2)

   unitid  year  student fte
0  100654  2001         5223
1  100663  2001        11614

In [144]:
fte_2002 = pd.read_csv("2002_ef_enrollment.csv",low_memory=False)
fte_2002.columns = fte_2002.columns.str.lower()
fte_2002 = fte_2002[['unitid','year','total fte']]
fte_2002 = fte_2002.rename(columns={'total fte':'student fte'})
fte_2002.head(2)

   unitid  year  student fte
0  100654  2002         5261
1  100663  2002        12353

In [190]:
merge = pd.concat([fte_2001,fte_2002],ignore_index=False)
merge.head(2)

   unitid  year  student fte
0  100654  2001         5223
1  100663  2001        11614

In [191]:
fte_2003 = pd.read_csv("fte_2003.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2003.columns = cols
fte_2003.columns = fte_2003.columns.str.lower()
fte_2003['year'] = 2003
fte_2003.head(2)

   unitid                    institution name  year  student fte
0  100636  Community College of the Air Force  2003          NaN
1  100654            Alabama A & M University  2003       6745.0

In [192]:
fte_2004 = pd.read_csv("fte_2004.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2004.columns = cols
fte_2004.columns = fte_2004.columns.str.lower()
fte_2004['year'] = 2004
fte_2004.head(2)

   unitid                    institution name  year  student fte
0  100636  Community College of the Air Force  2004          NaN
1  100654            Alabama A & M University  2004       6258.0

In [193]:
fte_2005 = pd.read_csv("fte_2005.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2005.columns = cols
fte_2005.columns = fte_2005.columns.str.lower()
fte_2005['year'] = 2005
fte_2005.head(2)

   unitid                    institution name  year  student fte
0  100636  Community College of the Air Force  2005          NaN
1  100654            Alabama A & M University  2005       5888.0

In [194]:
fte_2006 = pd.read_csv("fte_2006.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2006.columns = cols
fte_2006.columns = fte_2006.columns.str.lower()
fte_2006['year'] = 2006
fte_2006.head(2)

   unitid                    institution name  year  student fte
0  100636  Community College of the Air Force  2006      86433.0
1  100654            Alabama A & M University  2006       5742.0

In [195]:
fte_2007 = pd.read_csv("fte_2007.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2007.columns = cols
fte_2007.columns = fte_2007.columns.str.lower()
fte_2007['year'] = 2007
fte_2007.head(2)

   unitid                    institution name  year  student fte
0  100636  Community College of the Air Force  2007          NaN
1  100654            Alabama A & M University  2007       5345.0

In [196]:
fte_2008 = pd.read_csv("fte_2008.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2008.columns = cols
fte_2008.columns = fte_2008.columns.str.lower()
fte_2008['year'] = 2008
fte_2008.head(2)

   unitid                    institution name  year  student fte
0  100636  Community College of the Air Force  2008      49880.0
1  100654            Alabama A & M University  2008       5051.0

In [197]:
fte_2009 = pd.read_csv("fte_2009.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2009.columns = cols
fte_2009.columns = fte_2009.columns.str.lower()
fte_2009['year'] = 2009
fte_2009.head(2)

   unitid                    institution name  year  student fte
0  100636  Community College of the Air Force  2009          NaN
1  100654            Alabama A & M University  2009       5021.0

In [198]:
fte_2010 = pd.read_csv("fte_2010.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2010.columns = cols
fte_2010.columns = fte_2010.columns.str.lower()
fte_2010['year'] = 2010
fte_2010.head(2)

   unitid                    institution name  year  student fte
0  100636  Community College of the Air Force  2010          NaN
1  100654            Alabama A & M University  2010       5243.0

In [199]:
fte_2011 = pd.read_csv("fte_2011.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2011.columns = cols
fte_2011.columns = fte_2011.columns.str.lower()
fte_2011['year'] = 2011
fte_2011.head(2)

   unitid                    institution name  year  student fte
0  100636  Community College of the Air Force  2011          NaN
1  100654            Alabama A & M University  2011       4461.0

In [200]:
fte_2012 = pd.read_csv("fte_2012.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2012.columns = cols
fte_2012.columns = fte_2012.columns.str.lower()
fte_2012['year'] = 2012
fte_2012.head(2)

   unitid                    institution name  year  student fte
0  100636  Community College of the Air Force  2012          NaN
1  100654            Alabama A & M University  2012       4524.0

In [178]:
fte_2013 = pd.read_csv("fte_2013.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2013.columns = cols
fte_2013.columns = fte_2013.columns.str.lower()
fte_2013['year'] = 2013
fte_2013.head(2)

   unitid                     institution name  year  student fte
0  100654             Alabama A & M University  2013       4419.0
1  100663  University of Alabama at Birmingham  2013      16338.0

In [179]:
fte_2014 = pd.read_csv("fte_2014.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2014.columns = cols
fte_2014.columns = fte_2014.columns.str.lower()
fte_2014['year'] = 2014
fte_2014.head(2)

   unitid                    institution name  year  student fte
0  100636  Community College of the Air Force  2014          NaN
1  100654            Alabama A & M University  2014       4606.0

In [180]:
fte_2015 = pd.read_csv("fte_2015.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2015.columns = cols
fte_2015.columns = fte_2015.columns.str.lower()
fte_2015['year'] = 2015
fte_2015.head(2)

   unitid                     institution name  year  student fte
0  100654             Alabama A & M University  2015       4805.0
1  100663  University of Alabama at Birmingham  2015      16651.0

In [181]:
fte_2016 = pd.read_csv("fte_2016.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2016.columns = cols
fte_2016.columns = fte_2016.columns.str.lower()
fte_2016['year'] = 2016
fte_2016.head(2)

   unitid                     institution name  year  student fte
0  100654             Alabama A & M University  2016       5042.0
1  100663  University of Alabama at Birmingham  2016      18017.0

In [182]:
fte_2017 = pd.read_csv("fte_2017.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2017.columns = cols
fte_2017.columns = fte_2017.columns.str.lower()
fte_2017['year'] = 2017
fte_2017.head(2)

   unitid                     institution name  year  student fte
0  100654             Alabama A & M University  2017       5651.0
1  100663  University of Alabama at Birmingham  2017      19254.0

In [183]:
fte_2018 = pd.read_csv("fte_2018.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2018.columns = cols
fte_2018.columns = fte_2018.columns.str.lower()
fte_2018['year'] = 2018
fte_2018.head(2)

   unitid                     institution name  year  student fte
0  100654             Alabama A & M University  2018       5943.0
1  100663  University of Alabama at Birmingham  2018      19834.0

In [184]:
fte_2019 = pd.read_csv("fte_2019.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2019.columns = cols
fte_2019.columns = fte_2019.columns.str.lower()
fte_2019['year'] = 2019
fte_2019.head(2)

   unitid                     institution name  year  student fte
0  100654             Alabama A & M University  2019       6221.0
1  100663  University of Alabama at Birmingham  2019      20435.0

In [185]:
fte_2020 = pd.read_csv("fte_2020.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2020.columns = cols
fte_2020.columns = fte_2020.columns.str.lower()
fte_2020['year'] = 2020
fte_2020.head(2)

   unitid                     institution name  year  student fte
0  100654             Alabama A & M University  2020       5289.0
1  100663  University of Alabama at Birmingham  2020      20850.0

In [186]:
fte_2021 = pd.read_csv("fte_2021.csv",low_memory=False)
cols = ['unitid','institution name','year','student fte']
fte_2021.columns = cols
fte_2021.columns = fte_2021.columns.str.lower()
fte_2021['year'] = 2021
fte_2021.head(2)

   unitid                     institution name  year  student fte
0  100654             Alabama A & M University  2021       5416.0
1  100663  University of Alabama at Birmingham  2021      17721.0

In [187]:
merge2 = pd.concat([fte_2003,fte_2004,fte_2005,fte_2006,fte_2007,fte_2008,fte_2009,fte_2010,fte_2011,fte_2012,fte_2013,fte_2014,fte_2015,fte_2016,fte_2017,fte_2018,fte_2019,fte_2020,fte_2021],ignore_index=False)
merge2.head()

#print(merge2.groupby('year')['unitid'].nunique())

year
2003    7021
2004    6915
2005    7013
2006    7048
2007    7050
2008    7126
2009    7313
2010    7488
2011    7642
2012    7735
2013    7764
2014    7687
2015    7647
2016    7521
2017    7121
2018    6857
2019    6527
2020    6440
2021    6273
Name: unitid, dtype: int64

In [202]:
merge2 = merge2.drop(['institution name'], axis=1)
merge2.head()

   unitid  year  student fte
0  100636  2003          NaN
1  100654  2003       6745.0
2  100663  2003      14996.0
3  100690  2003        678.0
4  100706  2003       5682.0

In [205]:
master = pd.concat([merge,merge2],ignore_index=False)
master.head()

   unitid  year  student fte
0  100654  2001       5223.0
1  100663  2001      11614.0
2  100690  2001        306.0
3  100706  2001       4996.0
4  100724  2001       4804.0

In [208]:
print(master.groupby('year')['unitid'].nunique())

year
2001    6560
2002    6526
2003    7021
2004    6915
2005    7013
2006    7048
2007    7050
2008    7126
2009    7313
2010    7488
2011    7642
2012    7735
2013    7764
2014    7687
2015    7647
2016    7521
2017    7121
2018    6857
2019    6527
2020    6440
2021    6273
Name: unitid, dtype: int64

In [209]:
#ef_merge = pd.concat([ef_2001,ef_2002,ef_2003,ef_2004,ef_2005,ef_2006,ef_2007,ef_2008,ef_2009,ef_2010,ef_2011,ef_2012,ef_2013,ef_2014,ef_2015,ef_2016,ef_2017,ef_2018,ef_2019,ef_2020,ef_2021],ignore_index=False)
#ef_merge.info()

Export to master merge folder:

In [211]:
master.to_csv('/Users/ellenruthconnell/Documents/IPEDS/join/student_enrollment_fte_master.csv',index=False)